app/controllers/albums_controller.rb

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
---
  def edit
    @album = Album.find(params[:id])

INSERT INTO "albums" ("updated_at", "title", "description", "user_id", "parent_id", "created_at") VALUES('2009-11-22 17:32:40', 'Album', 'Taki se album', NULL, NULL, '2009-11-22 17:32:40')
---
  def create
    @album = Album.new(params[:album])

    respond_to do |format|
      if @album.save

SELECT * FROM `albums` WHERE (`albums`.`id` = 1)
UPDATE `albums` SET `title` = 'mama', `description` = 'test', `updated_at` = '2009-11-21 17:56:28' WHERE `id` = 1
---
  def update
    @album = Album.find(params[:id])

    respond_to do |format|
      if @album.update_attributes(params[:album])