app/controllers/photos_controller.rb

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
---
  def show
    @photo = Photo.find(params[:id])

SELECT * FROM "photos" WHERE ("photos"."id" = 3)
---
  def edit
    @photo = Photo.find(params[:id])

INSERT INTO "photos" ("updated_at", "title", "album_id", "user_id", "created_at") VALUES('2009-11-22 17:34:03', 'Fota', 1, 1, '2009-11-22 17:34:03')
---
  def create
    @photo = Photo.new(params[:photo])
    @albums = Album.find(:all)

    respond_to do |format|
      if @photo.save

SELECT * FROM "photos" WHERE ("photos"."id" = 1)
DELETE FROM "photos" WHERE "id" = 1
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy